RT-Thread/rt-thread/bsp/renesas/ra4e2-ek2/script/R7FA4E2B9.svd
                <register>
                    <name>CFSAMONB</name>
                    <description>Code Flash Security Attribution Register B</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff0003ff</resetMask>
                    <fields>
                        <field>
                            <name>CFS1</name>
                            <description>Code Flash Secure area 1</description>
                            <lsb>10</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DFSAMON</name>
                    <description>Data Flash Security Attribution Register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000fc00</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>DFS</name>
                            <description>Data flash Secure area</description>
                            <lsb>10</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>0 KB</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x01</name>
                                    <description>1 KB</description>
                                    <value>0x01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x02</name>
                                    <description>2 KB</description>
                                    <value>0x02</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x03</name>
                                    <description>3 KB</description>
                                    <value>0x03</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x04</name>
                                    <description>4 KB</description>
                                    <value>0x04</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSAMONA</name>
                    <description>SRAM Security Attribution Register A</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x001fe000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SS2</name>
                            <description>SRAM Secure area 2</description>
                            <lsb>13</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x000</name>
                                    <description>0 KB</description>
                                    <value>0x000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x001</name>
                                    <description>8 KB</description>
                                    <value>0x001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x002</name>
                                    <description>16 KB</description>
                                    <value>0x002</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x003</name>
                                    <description>24 KB</description>
                                    <value>0x003</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x004</name>
                                    <description>32 KB</description>
                                    <value>0x004</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x005</name>
                                    <description>40 KB</description>
                                    <value>0x005</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSAMONB</name>
                    <description>SRAM Security Attribution Register B</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x001ffc00</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SS1</name>
                            <description>SRAM secure area 1</description>
                            <lsb>10</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
