RT-Thread/rt-thread/bsp/renesas/ra4e2-ek2/script/R7FA4E2B9.svd
                <register>
                    <name>NQSTLV</name>
                    <description>Normal Queue Status Level Register</description>
                    <addressOffset>0x394</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000004</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CMDQFLV</name>
                            <description>Normal Command Queue Free Level</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSPQLV</name>
                            <description>Normal Response Queue Level</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IBIQLV</name>
                            <description>Normal IBI Queue Level</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IBISCNT</name>
                            <description>Normal IBI Status Count</description>
                            <lsb>24</lsb>
                            <msb>28</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NDBSTLV0</name>
                    <description>Normal Data Buffer Status Level Register 0</description>
                    <addressOffset>0x398</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000001</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TDBFLV</name>
                            <description>Normal Transmit Data Buffer Free Level</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDBLV</name>
                            <description>Normal Receive Data Buffer Level</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NRSQSTLV</name>
                    <description>Normal Receive Status Queue Status Level Register</description>
                    <addressOffset>0x3C0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RSQLV</name>
                            <description>Normal Receive Status Queue Level</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HQSTLV</name>
                    <description>High Priority Queue Status Level Register</description>
                    <addressOffset>0x3C4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000002</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CMDQLV</name>
                            <description>High Priority Command Queue Level</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSPQLV</name>
                            <description>High Priority Response Queue Level</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HDBSTLV</name>
                    <description>High Priority Data Buffer Status Level Register</description>
                    <addressOffset>0x3C8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000002</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TDBFLV</name>
                            <description>High Priority Transmit Data Buffer Free Level</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDBLV</name>
                            <description>High Priority Receive Data Buffer Level</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PRSTDBG</name>
                    <description>Present State Debug Register</description>
                    <addressOffset>0x3CC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0000000f</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SCILV</name>
                            <description>SCL Line Signal Level</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SDILV</name>
                            <description>SDA Line Signal Level</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SCOLV</name>
                            <description>SCL Output Level</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>I3C has driven the SCL pin low.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>I3C has released the SCL pin.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SDOLV</name>
                            <description>SDA Output Level</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>I3C has driven the SDA pin low.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>I3C has released the SDA pin.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSERRCNT</name>
                    <description>Master Error Counters Register</description>
                    <addressOffset>0x3D0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>M2ECNT</name>
                            <description>M2 Error Counter</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SC1CPT</name>
                    <description>SC1 Capture monitor Register</description>
                    <addressOffset>0x3E0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SC1C</name>
                            <description>SC1 Capture</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SC2CPT</name>
                    <description>SC2 Capture monitor Register</description>
                    <addressOffset>0x3E4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SC2C</name>
                            <description>SC2 Capture</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
